Repository: kkurpiel/mobilne_automaty_komorkowe
Catalog: lib/l10n/app_*.arb
Languages: pl

# appName
source: Mobile Cellular Automaton
pl: Mobilne Automaty Komórkowe

# appNameFirst2
source: Mobile Cellular
pl: Mobilne Automaty

# appNameThird
source: Automaton
pl: Komórkowe

source: Simulation
pl: Symulacja

source: New Game
pl: Nowa Gra

source: Load Game
pl: Wczytaj Grę

source: Options
pl: Ustawienia

source: Author
pl: Autor

# aboutCellularAutomatons
source: About Automatons
pl: O Automatach

# whatIsCellularAutomatonTopic
source: What's a cellular automaton?
pl: Czym jest automat komórkowy?

# whatIsCellularAutomatonContent
source: Cellular automata are mathematical models consisting of a grid of cells, each in one of a limited number of states. Time in such systems is discrete – at each step, cells change their state based on fixed rules and the states of neighboring cells. Despite their simplicity, cellular automata can lead to highly complex behaviors. They are often used to study emergence – phenomena where complex system behavior arises from simple local rules.
pl: Automaty komórkowe to matematyczne modele złożone z siatki komórek, z których każda znajduje się w jednym z ograniczonego zbioru stanów. Czas w takim systemie jest dyskretny – w każdej turze komórki zmieniają swój stan na podstawie ustalonych reguł i stanów sąsiednich komórek. Pomimo prostoty, automaty komórkowe mogą prowadzić do bardzo złożonego zachowania. Są one często wykorzystywane do badania emergencji – zjawisk, w których z prostych lokalnych zasad wyłania się złożone zachowanie systemu.

# whatIsCellularAutomatonLearnMore
source: Learn more
pl: Dowiedz się więcej

# whatIsCellularAutomatonUrl
source: https://en.wikipedia.org/wiki/Cellular_automaton
pl: https://pl.wikipedia.org/wiki/Automat_kom%C3%B3rkowy

# usageAndMeaningTopic
source: Usage and meaning
pl: Zastosowanie i znaczenie

# usageAndMeaningContent
source: Cellular automata are used in many scientific fields, such as physics, biology, computer science, and chemistry. They serve to model natural phenomena, like the spread of fire, population growth, crystallization, or even information flow in networks. Studying them helps us understand how global patterns and complex systems can emerge from local rules. They are increasingly applied in artificial intelligence, urban simulations, and designing nature-inspired algorithms.
pl: Automaty komórkowe to fascynujące matematyczne modele, które symulują systemy złożone, wychodząc od niezwykle prostych założeń. Wyobraź sobie siatkę, na przykład dwuwymiarową, składającą się z niezliczonych komórek. Każda z tych komórek nie jest bynajmniej skomplikowanym bytem – wręcz przeciwnie, może przyjmować zaledwie jeden z ograniczonego zestawu stanów, na przykład "żywy" lub "martwy", "czarny" lub "biały". To właśnie ta prostota na poziomie pojedynczej komórki jest kluczem do ich niezwykłości. Czas w systemie automatów komórkowych jest dyskretny, co oznacza, że rozwija się w z góry określonych "turach" lub "krokach czasowych". W każdej takiej turze, każda komórka jednocześnie aktualizuje swój stan. Ale na jakiej podstawie? Otóż zmiany te zachodzą na podstawie ściśle określonych reguł oraz, co najważniejsze, stanów sąsiednich komórek. Reguły te są zazwyczaj bardzo proste – na przykład: "jeśli żywa komórka ma mniej niż dwóch żywych sąsiadów, umiera z samotności" lub "jeśli martwa komórka ma dokładnie trzech żywych sąsiadów, ożywa". Od Prostoty do Złożoności: Zjawisko Emergencji To, co czyni automaty komórkowe tak intrygującymi, to fakt, że pomimo banalnej prostoty poszczególnych reguł lokalnych, system jako całość może generować niezwykle złożone i często nieprzewidywalne zachowania. Z prostych interakcji między komórkami wyłaniają się zjawiska emergencji – wzory, struktury, a nawet formy "życia", które nie są bezpośrednio zaprogramowane w pojedynczej regule, lecz powstają jako wypadkowa milionów lokalnych interakcji. Dzięki tej właściwości, automaty komórkowe są niezastąpionym narzędziem do badania emergencji w wielu dziedzinach. Od biologii, gdzie symulują wzrost organizmów czy rozprzestrzenianie się epidemii, przez fizykę, gdzie modelują zjawiska fazowe, po informatykę, gdzie stanowią podstawę dla niektórych algorytmów. Pokazują, jak skomplikowane globalne zachowanie może narodzić się z prostych lokalnych zasad, dając wgląd w mechanizmy, które rządzą zarówno naturą, jak i złożonymi systemami stworzonymi przez człowieka.

# usageAndMeaningLearnMore
source: Learn more
pl: Dowiedz się więcej

# usageAndMeaningUrl
source: https://en.wikipedia.org/wiki/Cellular_automaton
pl: https://pl.wikipedia.org/wiki/Automat_kom%C3%B3rkowy

# conwaysGameOfLifeTopic
source: Conway's Game of Life
pl: Gra w życie Conway'a

# conwaysGameOfLifeContent
source: The most well-known example of a cellular automaton is the Game of Life, created by John Conway in 1970. It operates on a two-dimensional grid where each cell is either “alive” or “dead.” The rules determine the birth, survival, or death of a cell based on the number of its neighbors. Although the rules are simple, the game produces surprising patterns – from stable structures to objects that move or replicate. The Game of Life has inspired scientists and artists alike, demonstrating how order can emerge from apparent chaos.
pl: Najbardziej znanym przykładem automatu komórkowego jest Gra w życie stworzona przez Johna Conwaya w 1970 roku. Działa na siatce dwuwymiarowej, gdzie każda komórka jest „żywa” lub „martwa”. Reguły określają narodziny, przeżycie lub śmierć komórki na podstawie liczby sąsiadów. Mimo prostych zasad, gra prowadzi do zaskakujących wzorców – od stabilnych struktur po obiekty, które się poruszają lub rozmnażają. Gra w życie zainspirowała wielu badaczy i artystów, pokazując, jak z chaosu może wyłonić się porządek.

# conwaysGameOfLifeLearnMore
source: Learn more
pl: Dowiedz się więcej

# conwaysGameOfLifeUrl
source: https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life
pl: https://pl.wikipedia.org/wiki/Gra_w_%C5%BCycie

source: Can't open URL.
pl: Nie można otworzyć URL.

source: columns
pl: kolumny

source: rows
pl: wiersze

source: fps
pl: klatki na sekundę

source: Generation
pl: Generacja

# noMoreAliveCells
source: The simulation is finished. No more living cells
pl: Symulacja została zakończona. Brak żyjących komórek

# gridSameAsPrevious
source: The simulation has been looped
pl: Symulacja została zapętlona.

source: Current Generation
pl: Aktualna generacja

source: Your Prediction
pl: Twoja odpowiedź

source: Submit
pl: Zatwierdź

# correctAnswer
source: Correct! Next level...
pl: Poprawna odpowiedź! Następny poziom...

source: Wrong answer. Try again.
pl: Niepoprawna odpowiedź. Spróbuj ponownie.

source: Level
pl: Poziom

source: Error
pl: Błąd

source: Saved
pl: Zapisano

source: Save
pl: Zapisz

source: Name of the game
pl: Nazwa rozgrywki

# nameOfTheGameEg
source: e.g. My game
pl: np. Moja gra

source: Delete
pl: Usuń

source: Select saved games
pl: Wybierz zapisane gry

source: Something is wrong
pl: Coś poszło nie tak

# confirmDelete
source: Do you really want to delete selected games?
pl: Czy na pewno chcesz usunąć wybrane gry?
